[Killed] BlockStatement
main/components/Users/UsersTable.js:92:27
     ]
 
     var retColumns;
-    if (showToggleButtons){
-        retColumns = buttonColumns;
-    }else{
+    if (showToggleButtons){}else{
         retColumns = columns;
     }
killedBy: UserTable tests Has the expected column headers and content when toggle is true
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:92:9
     ]
 
     var retColumns;
-    if (showToggleButtons){
+    if (false){
         retColumns = buttonColumns;
     }else{
killedBy: UserTable tests Has the expected column headers and content when toggle is true
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Users/UsersTable.js:94:10
     var retColumns;
     if (showToggleButtons){
         retColumns = buttonColumns;
-    }else{
-        retColumns = columns;
-    }
+    }else{}
 
     return <OurTable
killedBy: UserTable tests renders without crashing for empty table
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
main/components/Users/UsersTable.js:102:17
         data={users}
         showToggleButtons={showToggleButtons}
         columns={retColumns}
-        testid={"UsersTable"} />;
+        testid={""} />;
 };
 
killedBy: UserTable tests Has the expected column headers and content when toggle is false
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-githubId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
