[Killed] BlockStatement
main/components/Utils/UsersTableUtils.js:3:51
 import { toast } from "react-toastify";
 
-export function cellToAxiosParamsToggleAdmin(cell){
-    return{
-        url: "/api/admin/users/toggleAdmin",
-        method: "POST",
-        params:{
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsToggleAdmin(cell){}
 
 export function cellToAxiosParamsToggleInstructor(cell){
killedBy: UsersTableUtils cellToAxiosParamsDelete Admin returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"id": "admin"}, "url": "/api/admin/users/toggleAdmin"}
Received: undefined

[Killed] BlockStatement
main/components/Utils/UsersTableUtils.js:13:56
     }
 }
 
-export function cellToAxiosParamsToggleInstructor(cell){
-    return{
-        url: "/api/admin/users/toggleInstructor",
-        method: "POST",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsToggleInstructor(cell){}
 
 export function toggleAdminSuccess(message) {
killedBy: UsersTableUtils cellToAxiosParamsDelete Instructor returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"id": "instructor"}, "url": "/api/admin/users/toggleInstructor"}
Received: undefined

[Killed] ObjectLiteral
main/components/Utils/UsersTableUtils.js:14:11
 }
 
 export function cellToAxiosParamsToggleInstructor(cell){
-    return{
-        url: "/api/admin/users/toggleInstructor",
-        method: "POST",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return{}
 }
 
killedBy: UsersTableUtils cellToAxiosParamsDelete Instructor returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "POST",
-   "params": Object {
