[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:58:9
             accessor: 'end',
             // accessor: (row) => formatTime(row.end),
         },
-        {
-            Header: 'GithubOrg',
-            accessor: 'githubOrg',
-        }
+        {}
     ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:59:21
             // accessor: (row) => formatTime(row.end),
         },
         {
-            Header: 'GithubOrg',
+            Header: "",
             accessor: 'githubOrg',
         }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: GithubOrg. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;
