[Killed] BlockStatement
main/components/Courses/CoursesTable.js:14:36
     
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/courses/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/courses/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:31:9
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
     const columns = [
-        {
-            Header: 'id',
-            accessor: 'id',
-        },
+        {},
         {
             Header: 'Name',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:33:23
     const columns = [
         {
             Header: 'id',
-            accessor: 'id',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:40:21
             accessor: 'name',
         },
         {
-            Header: 'School',
+            Header: "",
             accessor: 'school',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: School. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:43:9
             Header: 'School',
             accessor: 'school',
         },
-        {
-            Header: 'Term',
-            accessor: 'term',
-        },
+        {},
         {
             Header: 'Start',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:45:23
         },
         {
             Header: 'Term',
-            accessor: 'term',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-term"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:49:23
         },
         {
             Header: 'Start',
-            accessor: 'start',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-start"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:61:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
     
     return <OurTable
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
