[Killed] StringLiteral
main/components/Courses/CourseForm.js:5:68
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function CourseForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function CourseForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: CourseCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/Courses/CourseForm.js:26:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="CourseForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: CourseForm tests renders correctly when passing in a Course
statusReason: Error: Unable to find an element by: [data-testid="CourseForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CourseForm.js:26:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="CourseForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="CourseForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: CourseCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/Courses/CourseForm.js:105:63
                             id="start"
                             type="datetime-local"
                             isInvalid={Boolean(errors.start)}
-                            {...register("start", { required: true })}
+                            {...register("start", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CourseForm.js:105:51
                             id="start"
                             type="datetime-local"
                             isInvalid={Boolean(errors.start)}
-                            {...register("start", { required: true })}
+                            {...register("start", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/CourseForm.js:120:61
                             id="end"
                             type="datetime-local"
                             isInvalid={Boolean(errors.end)}
-                            {...register("end", { required: true })}
+                            {...register("end", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /EndDate is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
