[Killed] ArrayDeclaration
main/components/Users/UsersTable.js:67:27
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleInstructorCallback = async (cell) => {toggleInstructorMutation.mutate(cell);}
 
-    const buttonColumns = [
-        ...columns,
-        ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
-    ]
+    const buttonColumns = []
 
     const retColumns = showToggleButtons ? buttonColumns : columns;
killedBy: UserTable tests Has the expected column headers and content when toggle is true
statusReason: TestingLibraryElementError: Unable to find an element with the text: githubId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] StringLiteral
main/components/Users/UsersTable.js:78:17
     return <OurTable
         columns={retColumns}
         data={users}
-        testid={"UsersTable"} />;
+        testid={""} />;
 };
 
killedBy: UserTable tests Has the expected column headers and content when toggle is false
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-githubId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
