[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:6:30
 import UsersTable from "main/components/Users/UsersTable"
 import { useBackend } from "main/utils/useBackend";
 
-const AdminUsersPage = () => {
-
-    const { data: users, error: _error, status: _status } =
-        useBackend(
-            // Stryker disable next-line all : don't test internal caching of React Query
-            ["/api/admin/users"],
-            // Stryker disable next-line StringLiteral,ObjectLiteral : since "GET" is default, "" is an equivalent mutation
-            { method: "GET", url: "/api/admin/users" },
-            // Stryker disable next-line all
-            []
-        );
-    const showToggleButtons = true;
-
-    return (
-        <BasicLayout>
-            <h2>Users</h2>
-            <UsersTable users={users} showToggleButtons={showToggleButtons}/>
-        </BasicLayout>
-    );
-};
+const AdminUsersPage = () => {};
 
 export default AdminUsersPage;
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: AdminUsersPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:17:31
             // Stryker disable next-line all
             []
         );
-    const showToggleButtons = true;
+    const showToggleButtons = false;
 
     return (
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
