[Killed] BooleanLiteral
src/main/pages/CourseCreatePage.js:7:53
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function CourseCreatePage({storybook=false}) {
+export default function CourseCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (course) => ({
killedBy: CourseCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/course/"}

Number of calls: 0

[Killed] ObjectLiteral
src/main/pages/CourseCreatePage.js:9:44
 
 export default function CourseCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-     name: course.name,
-     school: course.school,
-     term: course.term,
-     start: course.start,
-     end: course.end,
-     githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosParams = (course) => ({});
 
   const onSuccess = (course) => {
killedBy: CourseCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/CourseCreatePage.js:12:13
   const objectToAxiosParams = (course) => ({
     url: "/api/courses/post",
     method: "POST",
-    params: {
-     name: course.name,
-     school: course.school,
-     term: course.term,
-     start: course.start,
-     end: course.end,
-     githubOrg: course.githubOrg
-    }
+    params: {}
   });
 
killedBy: CourseCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "end": "2023-12-12T15:15",
-   "githubOrg": "ucsb-cs156-f23",

[Killed] BlockStatement
src/main/pages/CourseCreatePage.js:22:33
     }
   });
 
-  const onSuccess = (course) => {
-    toast(`New Course Created - id: ${course.id} name: ${course.name}`);
-  }
+  const onSuccess = (course) => {}
 
   const mutation = useBackendMutation(
killedBy: CourseCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Course Created - id: 1 name: CMPSC 156"

Number of calls: 0

[Killed] BlockStatement
src/main/pages/CourseCreatePage.js:39:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/course/" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CourseCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/course/"}

Number of calls: 0
