[Killed] BlockStatement
main/components/Utils/UsersTableUtils.js:3:45
 import { toast } from "react-toastify";
 
-export function toggleAdminSuccess(message) {
-    console.log(message);
-    toast(message);
-}
+export function toggleAdminSuccess(message) {}
 
 export function toggleInstructorSuccess(message) {
killedBy: UsersTableUtils toggleAdminSuccess Admin: It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc"

Number of calls: 0

[Killed] BlockStatement
main/components/Utils/UsersTableUtils.js:8:50
     toast(message);
 }
 
-export function toggleInstructorSuccess(message) {
-    console.log(message);
-    toast(message);
-}
+export function toggleInstructorSuccess(message) {}
 
 export function cellToAxiosParamsToggleAdmin(cell){
killedBy: UsersTableUtils toggleAdminSuccess Instructor: It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc"

Number of calls: 0

[Killed] BlockStatement
main/components/Utils/UsersTableUtils.js:13:51
     toast(message);
 }
 
-export function cellToAxiosParamsToggleAdmin(cell){
-    return{
-        url: "/api/admin/users/toggleAdmin",
-        method: "POST",
-        params:{
-            githubId: cell.row.values.githubId
-        }
-    }
-}
+export function cellToAxiosParamsToggleAdmin(cell){}
 
 export function cellToAxiosParamsToggleInstructor(cell){
killedBy: UsersTableUtils cellToAxiosParamsDelete Admin returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"githubId": "929"}, "url": "/api/admin/users/toggleAdmin"}
Received: undefined

[Killed] ObjectLiteral
main/components/Utils/UsersTableUtils.js:14:11
 }
 
 export function cellToAxiosParamsToggleAdmin(cell){
-    return{
-        url: "/api/admin/users/toggleAdmin",
-        method: "POST",
-        params:{
-            githubId: cell.row.values.githubId
-        }
-    }
+    return{}
 }
 
killedBy: UsersTableUtils cellToAxiosParamsDelete Admin returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "POST",
-   "params": Object {

[Killed] BlockStatement
main/components/Utils/UsersTableUtils.js:23:56
     }
 }
 
-export function cellToAxiosParamsToggleInstructor(cell){
-    return{
-        url: "/api/admin/users/toggleInstructor",
-        method: "POST",
-        params: {
-            githubId: cell.row.values.githubId
-        }
-    }
-}
+export function cellToAxiosParamsToggleInstructor(cell){}
 
killedBy: UsersTableUtils cellToAxiosParamsDelete Instructor returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "POST", "params": {"githubId": "512"}, "url": "/api/admin/users/toggleInstructor"}
Received: undefined

[Killed] ObjectLiteral
main/components/Utils/UsersTableUtils.js:24:11
 }
 
 export function cellToAxiosParamsToggleInstructor(cell){
-    return{
-        url: "/api/admin/users/toggleInstructor",
-        method: "POST",
-        params: {
-            githubId: cell.row.values.githubId
-        }
-    }
+    return{}
 }
 
killedBy: UsersTableUtils cellToAxiosParamsDelete Instructor returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "POST",
-   "params": Object {
