[Killed] ArrayDeclaration
main/pages/Courses/CourseIndexPage.js:33:7
       ["/api/courses/all"],
       // Stryker disable next-line all : GET is the default
       { method: "GET", url: "/api/courses/all" },
-      []
+      ["Stryker was here"]
     );
 
killedBy: CourseIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="CoursesTable-cell-row-0-col-id" role="cell" /> instead
