[Killed] BooleanLiteral
main/components/Courses/CourseForm.js:105:67
                             id="startDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
-                            {...register("startDate", { required: true })}
+                            {...register("startDate", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/CourseForm.js:120:65
                             id="endDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.endDate)}
-                            {...register("endDate", { required: true })}
+                            {...register("endDate", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /EndDate is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CourseForm.js:120:53
                             id="endDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.endDate)}
-                            {...register("endDate", { required: true })}
+                            {...register("endDate", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /EndDate is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
