[Killed] BlockStatement
main/pages/Courses/CoursesCreatePage.js:39:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/courses/" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CoursesCreatePage tests on submit, makes request to backend, and redirects to /courses
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/courses/"}

Number of calls: 0
