[Killed] ArrowFunction
main/pages/Courses/CoursesEditPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses/update",
-    method: "PUT",
-    params: {
-      courseId: course.id,
-    },
-    data: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Courses/CoursesEditPage.js:26:47
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses/update",
-    method: "PUT",
-    params: {
-      courseId: course.id,
-    },
-    data: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosPutParams = (course) => ({});
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
