[Killed] ArrowFunction
main/pages/Courses/CoursesEditPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses",
-    method: "PUT",
-    params: {
-      id: course.id,
-    },
-    data: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      start: course.start,
-      end: course.end,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Courses/CoursesEditPage.js:26:47
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses",
-    method: "PUT",
-    params: {
-      id: course.id,
-    },
-    data: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      start: course.start,
-      end: course.end,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosPutParams = (course) => ({});
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/CoursesEditPage.js:27:10
 
 
   const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses",
+    url: "",
     method: "PUT",
     params: {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Courses/CoursesEditPage.js:42:33
     }
   });
 
-  const onSuccess = (course) => {
-    toast(`Course Updated - id: ${course.id} githubOrg: ${course.githubOrg}`);
-  }
+  const onSuccess = (course) => {}
 
   const mutation = useBackendMutation(
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/Courses/CoursesEditPage.js:68:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          course && <CourseForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
+          course || <CourseForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: CoursesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="CourseForm-name" id="explantion" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/Courses/CoursesEditPage.js:68:11
       <div className="pt-2">
         <h1>Edit Course</h1>
         {
-          course && <CourseForm initialContents={course} submitAction={onSubmit} buttonLabel="Update" />
+          true
         }
       </div>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CourseForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
